anthony-gagliardi/week_05/day-02/oceans/app/controllers/oceans_controller.rb

  def index
    @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

  def create
    oceans = Ocean.create oceans_params
---
INSERT INTO "oceans" ("name", "location", "depth", "area") VALUES (?, ?, ?, ?)  [["name", "El Puddlè"], ["location", 0.0], ["depth", 3.0], ["area", 0.0]]

  def show
    @oceans = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT 1  [["id", 1]]