guy-chamberlain/week_05/Wednesday/bookstore/app/views/authors/show.html.erb

Books written :
<% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 1]]