guy-chamberlain/week_05/Wednesday/bookstore/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@author = Author.find params[:id]

INSERT INTO "authors" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		author = Author.create author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
	def update
		author = Author.find params[:id]