guy-chamberlain/week_05/Wednesday/bookstore/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@book = Book.find params[:id]

INSERT INTO "books" ("title", "publication_date", "image", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		book = Book.create book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@book = Book.find params[:id]

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Rails for Dummies"], ["updated_at", "2015-09-02 07:13:21.404325"], ["id", 1]]
---
	def update
		book = Book.find params[:id]
		book.update book_params