guy-chamberlain/week_05/Wednesday/bookstore/app/views/books/_form.html.erb

		<label>Author</label>
		<%= f.select :author_id, Author.all.map {|a| [a.name, a.id]}, :include_blank => true %>
---
SELECT "authors".* FROM "authors"