guy-chamberlain/week_05/Tuesday/app/controllers/oceans_controller.rb

SELECT "oceans".* FROM "oceans"
---
	def index
		@oceans = Ocean.all

INSERT INTO "oceans" ("name", "image", "km_square") VALUES (?, ?, ?)  [["name", "Atlantic"], ["image", "https://upload.wikimedia.org/wikipedia/commons/e/e0/Clouds_over_the_Atlantic_Ocean.jpg"], ["km_square", 76762000]]
---
	def create
		o = Ocean.create ocean_params

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@ocean = Ocean.find params[:id]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@ocean = Ocean.find params[:id]

SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "oceans" SET "image" = ? WHERE "oceans"."id" = ?  [["image", "https://upload.wikimedia.org/wikipedia/commons/f/f6/Pacific_Ocean_-_en.png"], ["id", 1]]
---
	def update
		o = Ocean.find params[:id]
		o.update ocean_params